---
kind: property
id: P:Autodesk.Revit.UI.ComboBoxMember.GroupName
source: html/6101c38e-8ff6-eac9-eb62-79fbb024f8e2.htm
---
# Autodesk.Revit.UI.ComboBoxMember.GroupName Property

The group to which the ComboBoxMember is assigned.

## Syntax (C#)
```csharp
public string GroupName { get; }
```

## Remarks
If set, the ComboBoxMember appears under a group header in the ComboBox. If Nothing nullptr a null reference ( Nothing in Visual Basic) , the ComboBoxMember is not a member of any group.
The default value is Nothing nullptr a null reference ( Nothing in Visual Basic) .